MONTH_DICT = {
    1: 'січня',
    2: 'лютого',
    3: 'березня',
    4: 'квітня',
    5: 'травня',
    6: 'червня',
    7: 'липня',
    8: 'серпня',
    9: 'вересня',
    10: 'жовтня',
    11: 'листопада',
    12: 'грудня'
}


NUMBERS_DICT_GENITIVE_CASE = {
    0: '',
    1: 'першого',
    2: 'другого',
    3: 'третього',
    4: 'четвертого',
    5: 'п\'ятого',
    6: 'шостого',
    7: 'сьомого',
    8: 'восьмого',
    9: 'дев\'ятого',
    10: 'десятого',
    11: 'одинадцятого',
    12: 'дванадцятого',
    13: 'тринадцятого',
    14: 'чотирнадцятого',
    15: 'п\'ятьнадцятого',
    16: 'шістнадцятого',
    17: 'сімндцятого',
    18: 'вісімнадцятого',
    19: 'дев\'ятнадцятого',
    20: 'двацятого',
    21: 'двадцять першого',
    22: 'двадцять другого',
    23: 'двадцять третього',
    24: 'двадцять четвертого',
    25: 'двадцять п\'ятого',
    26: 'двадцять шостого',
    27: 'двадцять сьомого',
    28: 'двадцять восьмого',
    29: 'двадцять дев\'ятого',
    30: 'тридцятого',
    31: 'тридцять першого'
}


NUMBES_DICT_THOUSANDS = {
    1: '',
    2: 'двох',
    3: 'трьох',
    4: 'чотирох',
    5: 'п\'яти',
    6: 'шести',
    7: 'семи',
    8: 'восьми',
    9: 'дев\'яти'
}


NUMBERS_DICT = {
    0: '',
    1: 'одна',
    2: 'дві',
    3: 'три',
    4: 'чотири',
    5: 'п\'ять',
    6: 'шість',
    7: 'сім',
    8: 'вісім',
    9: 'дев\'ять'
}


NUMBERS_DICT_HUNDREDS = {
    0: '',
    1: 'сто',
    2: 'двісті',
    3: 'триста',
    4: 'чотириста',
    5: 'п\'ятсот',
    6: 'шістсот',
    7: 'сімсот',
    8: 'вісімсот',
    9: 'дев\'ятьсот'
}

NUMBERS_DICT_ONLY_HUNDREDS = {
    0: '',
    1: 'сотого',
    2: 'двохсотого',
    3: 'трьохсотого',
    4: 'чотирьохсотого',
    5: 'п\'ятсотого',
    6: 'шістсотого',
    7: 'сімсотого',
    8: 'вісімсотого',
    9: 'дев\'ятьсотого'
}


NUMBERS_DICT_TENS = {
    0: '',
    1: 'десятого',
    2: 'двадцятого',
    3: 'тридцятого',
    4: 'сорокового',
    5: 'п\'ятдесятого',
    6: 'шістдесятого',
    7: 'сімдесятого',
    8: 'вісімдесятого',
    9: 'дев\'яностого'
}


NUMBERS_DICT_ONLY_TENS = {
    0: '',
    1: '',
    2: 'двадцять',
    3: 'тридцять',
    4: 'сорок',
    5: 'п\'ятдесят',
    6: 'шістдесят',
    7: 'сімдесят',
    8: 'вісімдесят',
    9: 'дев\'яност'
}


NUMBERS_DICT_NOMINATIVE = {
    0: '',
    1: 'перше',
    2: 'друге',
    3: 'третє',
    4: 'четверте',
    5: 'п\'яте',
    6: 'шосте',
    7: 'сьоме',
    8: 'восьме',
    9: 'дев\'яте',
    10: 'десяте',
    11: 'одинадцяте',
    12: 'дванадцяте',
    13: 'тринадцяте',
    14: 'чотирнадцяте',
    15: 'п\'ятьнадцяте',
    16: 'шістнадцяте',
    17: 'сімндцяте',
    18: 'вісімнадцяте',
    19: 'дев\'ятнадцяте',
    20: 'двацяте',
    21: 'двадцять перше',
    22: 'двадцять друге',
    23: 'двадцять третьє',
    24: 'двадцять четверте',
    25: 'двадцять п\'яте',
    26: 'двадцять шосте',
    27: 'двадцять сьоме',
    28: 'двадцять восьме',
    29: 'двадцять дев\'яте',
    30: 'тридцяте',
    31: 'тридцять перше'
}
